; domain
(define (domain dragonfly)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        lilypad - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (alighted ?x - lilypad)
    )
    (:functions
        (north)
        (east)
        (up)
        (pad_north ?l - lilypad)
        (pad_east ?l - lilypad)
        (pad_up ?l - lilypad)
        (nectar-level)
        (nectar-level-full)
        (min_north)
        (max_north)
        (min_east)
        (max_east)
        (min_up)
        (max_up)
    )

    (:action fly_north
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (north) (- (max_north) 1))
        )
        :effect (and (increase (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_south
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (north) (+ (min_north) 1))
        )
        :effect (and (decrease (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_east
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (east) (- (max_east) 1))
        )
        :effect (and (increase (east) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_west
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (east) (+ (min_east) 1))
        )
        :effect (and (decrease (east) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_up
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (up) (- (max_up) 1))
        )
        :effect (and (increase (up) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_down
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (up) (+ (min_up) 1))
        )
        :effect (and (decrease (up) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action alight
        :parameters (?l - lilypad)
        :precondition (and
            (>= (nectar-level) 1)
            (= (pad_north ?l) (north))
            (= (pad_east ?l) (east))
            (= (pad_up ?l) (up))
        )
        :effect (and (alighted ?l)
            (decrease (nectar-level) 1))
    )

    (:action refuel_nectar
        :parameters ()
        :precondition (and
            (= (north) 0)
            (= (east) 0)
            (= (up) 0)
        )
        :effect (and
            (assign (nectar-level) (nectar-level-full)))
    )

)

; problem
;;Instance with 2x9x1 points
(define (problem name) (:domain dragonfly)
(:objects
pad_0_0_0 - lilypad
pad_0_1_0 - lilypad
pad_0_2_0 - lilypad
pad_0_3_0 - lilypad
pad_0_4_0 - lilypad
pad_0_5_0 - lilypad
pad_0_6_0 - lilypad
pad_0_7_0 - lilypad
pad_0_8_0 - lilypad
pad_1_0_0 - lilypad
pad_1_1_0 - lilypad
pad_1_2_0 - lilypad
pad_1_3_0 - lilypad
pad_1_4_0 - lilypad
pad_1_5_0 - lilypad
pad_1_6_0 - lilypad
pad_1_7_0 - lilypad
pad_1_8_0 - lilypad
)
(:init (= (north) 0) (= (east) 0) (= (up) 0)
 (= (min_north) 0)  (= (max_north) 2)
 (= (min_east) 0)  (= (max_east) 9)
 (= (min_up) 0)  (= (max_up) 1)
(= (pad_north pad_0_0_0) 0)
(= (pad_east pad_0_0_0) 0)
(= (pad_up pad_0_0_0) 0)
(= (pad_north pad_0_1_0) 0)
(= (pad_east pad_0_1_0) 1)
(= (pad_up pad_0_1_0) 0)
(= (pad_north pad_0_2_0) 0)
(= (pad_east pad_0_2_0) 2)
(= (pad_up pad_0_2_0) 0)
(= (pad_north pad_0_3_0) 0)
(= (pad_east pad_0_3_0) 3)
(= (pad_up pad_0_3_0) 0)
(= (pad_north pad_0_4_0) 0)
(= (pad_east pad_0_4_0) 4)
(= (pad_up pad_0_4_0) 0)
(= (pad_north pad_0_5_0) 0)
(= (pad_east pad_0_5_0) 5)
(= (pad_up pad_0_5_0) 0)
(= (pad_north pad_0_6_0) 0)
(= (pad_east pad_0_6_0) 6)
(= (pad_up pad_0_6_0) 0)
(= (pad_north pad_0_7_0) 0)
(= (pad_east pad_0_7_0) 7)
(= (pad_up pad_0_7_0) 0)
(= (pad_north pad_0_8_0) 0)
(= (pad_east pad_0_8_0) 8)
(= (pad_up pad_0_8_0) 0)
(= (pad_north pad_1_0_0) 1)
(= (pad_east pad_1_0_0) 0)
(= (pad_up pad_1_0_0) 0)
(= (pad_north pad_1_1_0) 1)
(= (pad_east pad_1_1_0) 1)
(= (pad_up pad_1_1_0) 0)
(= (pad_north pad_1_2_0) 1)
(= (pad_east pad_1_2_0) 2)
(= (pad_up pad_1_2_0) 0)
(= (pad_north pad_1_3_0) 1)
(= (pad_east pad_1_3_0) 3)
(= (pad_up pad_1_3_0) 0)
(= (pad_north pad_1_4_0) 1)
(= (pad_east pad_1_4_0) 4)
(= (pad_up pad_1_4_0) 0)
(= (pad_north pad_1_5_0) 1)
(= (pad_east pad_1_5_0) 5)
(= (pad_up pad_1_5_0) 0)
(= (pad_north pad_1_6_0) 1)
(= (pad_east pad_1_6_0) 6)
(= (pad_up pad_1_6_0) 0)
(= (pad_north pad_1_7_0) 1)
(= (pad_east pad_1_7_0) 7)
(= (pad_up pad_1_7_0) 0)
(= (pad_north pad_1_8_0) 1)
(= (pad_east pad_1_8_0) 8)
(= (pad_up pad_1_8_0) 0)
(= (nectar-level) 25)
(= (nectar-level-full) 25)
)
(:goal (and
(alighted pad_0_0_0)
(alighted pad_0_1_0)
(alighted pad_0_2_0)
(alighted pad_0_3_0)
(alighted pad_0_4_0)
(alighted pad_0_5_0)
(alighted pad_0_6_0)
(alighted pad_0_7_0)
(alighted pad_0_8_0)
(alighted pad_1_0_0)
(alighted pad_1_1_0)
(alighted pad_1_2_0)
(alighted pad_1_3_0)
(alighted pad_1_4_0)
(alighted pad_1_5_0)
(alighted pad_1_6_0)
(alighted pad_1_7_0)
(alighted pad_1_8_0)
(= (north) 0) (= (east) 0) (= (up) 0) ))
);; end of the problem instance

; plan
1. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 25 to 24
   goals met: 2 of 21
2. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 24 to 23
   goals met: 2 of 21
3. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 23 to 22
   goals met: 2 of 21
4. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 22 to 21
   goals met: 2 of 21
5. (alight pad_0_4_0)
   added: (alighted pad_0_4_0)
   changed: (nectar-level) from 21 to 20
   goals met: 3 of 21
6. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 20 to 19
   goals met: 2 of 21
7. (alight pad_1_4_0)
   added: (alighted pad_1_4_0)
   changed: (nectar-level) from 19 to 18
   goals met: 3 of 21
8. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 18 to 17
   goals met: 4 of 21
9. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 17 to 16
   goals met: 4 of 21
10. (alight pad_0_3_0)
   added: (alighted pad_0_3_0)
   changed: (nectar-level) from 16 to 15
   goals met: 5 of 21
11. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 15 to 14
   goals met: 4 of 21
12. (alight pad_1_3_0)
   added: (alighted pad_1_3_0)
   changed: (nectar-level) from 14 to 13
   goals met: 5 of 21
13. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 13 to 12
   goals met: 5 of 21
14. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 12 to 11
   goals met: 5 of 21
15. (alight pad_1_5_0)
   added: (alighted pad_1_5_0)
   changed: (nectar-level) from 11 to 10
   goals met: 6 of 21
16. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 10 to 9
   goals met: 7 of 21
17. (alight pad_0_5_0)
   added: (alighted pad_0_5_0)
   changed: (nectar-level) from 9 to 8
   goals met: 8 of 21
18. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 8 to 7
   goals met: 8 of 21
19. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 7 to 6
   goals met: 8 of 21
20. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 6 to 5
   goals met: 8 of 21
21. (alight pad_0_2_0)
   added: (alighted pad_0_2_0)
   changed: (nectar-level) from 5 to 4
   goals met: 9 of 21
22. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 4 to 3
   goals met: 9 of 21
23. (alight pad_0_1_0)
   added: (alighted pad_0_1_0)
   changed: (nectar-level) from 3 to 2
   goals met: 10 of 21
24. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 2 to 1
   goals met: 11 of 21
25. (refuel_nectar)
   changed: (nectar-level) from 1 to 25
   goals met: 11 of 21
26. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 25 to 24
   goals met: 10 of 21
27. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 24 to 23
   goals met: 10 of 21
28. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 23 to 22
   goals met: 10 of 21
29. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 22 to 21
   goals met: 10 of 21
30. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 21 to 20
   goals met: 10 of 21
31. (fly_east)
   changed: (east) from 5 to 6, (nectar-level) from 20 to 19
   goals met: 10 of 21
32. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 19 to 18
   goals met: 9 of 21
33. (alight pad_1_6_0)
   added: (alighted pad_1_6_0)
   changed: (nectar-level) from 18 to 17
   goals met: 10 of 21
34. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 17 to 16
   goals met: 11 of 21
35. (alight pad_0_6_0)
   added: (alighted pad_0_6_0)
   changed: (nectar-level) from 16 to 15
   goals met: 12 of 21
36. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 15 to 14
   goals met: 11 of 21
37. (fly_west)
   changed: (east) from 6 to 5, (nectar-level) from 14 to 13
   goals met: 11 of 21
38. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 13 to 12
   goals met: 11 of 21
39. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 12 to 11
   goals met: 11 of 21
40. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 11 to 10
   goals met: 11 of 21
41. (alight pad_1_2_0)
   added: (alighted pad_1_2_0)
   changed: (nectar-level) from 10 to 9
   goals met: 12 of 21
42. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 9 to 8
   goals met: 12 of 21
43. (alight pad_1_1_0)
   added: (alighted pad_1_1_0)
   changed: (nectar-level) from 8 to 7
   goals met: 13 of 21
44. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 7 to 6
   goals met: 13 of 21
45. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 6 to 5
   goals met: 14 of 21
46. (alight pad_0_2_0)
   changed: (nectar-level) from 5 to 4
   goals met: 14 of 21
47. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 4 to 3
   goals met: 14 of 21
48. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 3 to 2
   goals met: 15 of 21
49. (alight pad_0_0_0)
   added: (alighted pad_0_0_0)
   changed: (nectar-level) from 2 to 1
   goals met: 16 of 21
50. (refuel_nectar)
   changed: (nectar-level) from 1 to 25
   goals met: 16 of 21
51. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 25 to 24
   goals met: 15 of 21
52. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 24 to 23
   goals met: 15 of 21
53. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 23 to 22
   goals met: 15 of 21
54. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 22 to 21
   goals met: 15 of 21
55. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 21 to 20
   goals met: 15 of 21
56. (fly_east)
   changed: (east) from 5 to 6, (nectar-level) from 20 to 19
   goals met: 15 of 21
57. (fly_east)
   changed: (east) from 6 to 7, (nectar-level) from 19 to 18
   goals met: 15 of 21
58. (alight pad_0_7_0)
   added: (alighted pad_0_7_0)
   changed: (nectar-level) from 18 to 17
   goals met: 16 of 21
59. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 17 to 16
   goals met: 15 of 21
60. (alight pad_1_7_0)
   added: (alighted pad_1_7_0)
   changed: (nectar-level) from 16 to 15
   goals met: 16 of 21
61. (fly_east)
   changed: (east) from 7 to 8, (nectar-level) from 15 to 14
   goals met: 16 of 21
62. (alight pad_1_8_0)
   added: (alighted pad_1_8_0)
   changed: (nectar-level) from 14 to 13
   goals met: 17 of 21
63. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 13 to 12
   goals met: 18 of 21
64. (fly_west)
   changed: (east) from 8 to 7, (nectar-level) from 12 to 11
   goals met: 18 of 21
65. (fly_west)
   changed: (east) from 7 to 6, (nectar-level) from 11 to 10
   goals met: 18 of 21
66. (fly_west)
   changed: (east) from 6 to 5, (nectar-level) from 10 to 9
   goals met: 18 of 21
67. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 9 to 8
   goals met: 18 of 21
68. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 8 to 7
   goals met: 18 of 21
69. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 7 to 6
   goals met: 18 of 21
70. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 6 to 5
   goals met: 18 of 21
71. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 5 to 4
   goals met: 19 of 21
72. (refuel_nectar)
   changed: (nectar-level) from 4 to 25
   goals met: 19 of 21
73. (alight pad_0_0_0)
   changed: (nectar-level) from 25 to 24
   goals met: 19 of 21
74. (alight pad_0_0_0)
   changed: (nectar-level) from 24 to 23
   goals met: 19 of 21
75. (alight pad_0_0_0)
   changed: (nectar-level) from 23 to 22
   goals met: 19 of 21
76. (alight pad_0_0_0)
   changed: (nectar-level) from 22 to 21
   goals met: 19 of 21
77. (alight pad_0_0_0)
   changed: (nectar-level) from 21 to 20
   goals met: 19 of 21
78. (alight pad_0_0_0)
   changed: (nectar-level) from 20 to 19
   goals met: 19 of 21
79. (alight pad_0_0_0)
   changed: (nectar-level) from 19 to 18
   goals met: 19 of 21
80. (alight pad_0_0_0)
   changed: (nectar-level) from 18 to 17
   goals met: 19 of 21
81. (alight pad_0_0_0)
   changed: (nectar-level) from 17 to 16
   goals met: 19 of 21
82. (alight pad_0_0_0)
   changed: (nectar-level) from 16 to 15
   goals met: 19 of 21
83. (alight pad_0_0_0)
   changed: (nectar-level) from 15 to 14
   goals met: 19 of 21
84. (alight pad_0_0_0)
   changed: (nectar-level) from 14 to 13
   goals met: 19 of 21
85. (alight pad_0_0_0)
   changed: (nectar-level) from 13 to 12
   goals met: 19 of 21
86. (alight pad_0_0_0)
   changed: (nectar-level) from 12 to 11
   goals met: 19 of 21
87. (alight pad_0_0_0)
   changed: (nectar-level) from 11 to 10
   goals met: 19 of 21
88. (alight pad_0_0_0)
   changed: (nectar-level) from 10 to 9
   goals met: 19 of 21
89. (alight pad_0_0_0)
   changed: (nectar-level) from 9 to 8
   goals met: 19 of 21
90. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 8 to 7
   goals met: 18 of 21
91. (alight pad_1_0_0)
   added: (alighted pad_1_0_0)
   changed: (nectar-level) from 7 to 6
   goals met: 19 of 21
92. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 6 to 5
   goals met: 20 of 21
93. (refuel_nectar)
   changed: (nectar-level) from 5 to 25
   goals met: 20 of 21
94. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 25 to 24
   goals met: 19 of 21
95. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 24 to 23
   goals met: 19 of 21
96. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 23 to 22
   goals met: 19 of 21
97. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 22 to 21
   goals met: 19 of 21
98. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 21 to 20
   goals met: 19 of 21
99. (fly_east)
   changed: (east) from 5 to 6, (nectar-level) from 20 to 19
   goals met: 19 of 21
100. (fly_east)
   changed: (east) from 6 to 7, (nectar-level) from 19 to 18
   goals met: 19 of 21
101. (fly_east)
   changed: (east) from 7 to 8, (nectar-level) from 18 to 17
   goals met: 19 of 21
102. (alight pad_0_8_0)
   added: (alighted pad_0_8_0)
   changed: (nectar-level) from 17 to 16
   goals met: 20 of 21
103. (fly_west)
   changed: (east) from 8 to 7, (nectar-level) from 16 to 15
   goals met: 20 of 21
104. (fly_west)
   changed: (east) from 7 to 6, (nectar-level) from 15 to 14
   goals met: 20 of 21
105. (fly_west)
   changed: (east) from 6 to 5, (nectar-level) from 14 to 13
   goals met: 20 of 21
106. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 13 to 12
   goals met: 20 of 21
107. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 12 to 11
   goals met: 20 of 21
108. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 11 to 10
   goals met: 20 of 21
109. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 10 to 9
   goals met: 20 of 21
110. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 9 to 8
   goals met: 21 of 21
